src/cf/Catalogs/ВидыКонтроля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыКонтроля</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипКонтроля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтроля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстШаблонаПредупреждения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Локальный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыКонтроля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПараметрыКонтроляПродаж</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ПараметрыКонтроляПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПараметрыКонтроляПродаж</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Возраст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВыводитьСообщение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредельноеЗначение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтверждениеЧерезMAX</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ТипыКонтроля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыКонтроля</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗапретПодбора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроверкаПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапретВидаОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапретРучнойСкидки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольСотрудникомНаКСО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольОстатков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛимитКоличестваВСтроке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛимитКоличестваСтрокВЧеке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛимитСуммыВЧеке</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ВидыКонтроля/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

// Значение типа "Параметра" в строке табличной части, которое было до выбора нового.
&НаКлиенте
Перем ПредыдущийПараметр;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Локальный = Истина;
	КонецЕсли;
	Доступность = Объект.Локальный Или Объект.Предопределенный;
	Если Объект.Ссылка = Справочники.ВидыКонтроля.ЗапретОплатыБонусами Тогда
		Элементы.ТипКонтроля.Доступность = Ложь;
	КонецЕсли;
	
	ОбщегоНазначенияРМК.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьДоступныеПараметрыПоТипуКонтроля();
	ОбработатьИзменениеТипаКонтроля();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПроверитьСообщитьПроЧужиеПараметрыВТекстеШаблона(Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипКонтроляПриИзменении(Элемент)
	
	НачатьИзменениеТипаКонтроля();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыПараметрыКонтроля

&НаКлиенте
Процедура ПараметрыКонтроляПараметрПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПараметрыКонтроля.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		
		Если ЗначениеЗаполнено(ТекущиеДанные.Параметр) И ЭтоДубльПараметра(ТекущиеДанные) Тогда
			ТекстОшибки = СтрШаблон(НСтр("ru='Параметр ""%1"" уже выбран в текущем виде контроля.'"),
				Строка(ТекущиеДанные.Параметр));
			ТекущиеДанные.Параметр = ПредыдущийПараметр;
			ПоказатьПредупреждение(Неопределено, ТекстОшибки);
		Иначе
			НастроитьПолеЗначения();
			ПредыдущийПараметр = ТекущиеДанные.Параметр;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыКонтроляПриАктивизацииСтроки(Элемент)
	
	НастроитьПолеЗначения();
	ЗапомнитьТекущийТипПараметра();
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыКонтроляПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ПараметрыКонтроля.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрКонтроляВозраст = ПредопределенноеЗначение("Перечисление.ПараметрыКонтроляПродаж.Возраст");
	Если НЕ ТекущиеДанные.Параметр = ПараметрКонтроляВозраст Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрКонтроляПодтверждениеЧерезMAX = ПредопределенноеЗначение(
		"Перечисление.ПараметрыКонтроляПродаж.ПодтверждениеЧерезMAX");
	Если ПараметрКонтроляДобавлен(ПараметрКонтроляПодтверждениеЧерезMAX) Тогда
		Отказ = Истина;
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПродолжениеПараметрыКонтроляУдаление",
			ЭтотОбъект);
		ЗаголовокВопроса = СтрШаблон(НСтр("ru='Удаление параметра ""%1"".'"),
			Строка(ПараметрКонтроляВозраст));
		ТекстВопроса = СтрШаблон(НСтр("ru='При удалении параметра ""%1"" будет также удален параметр ""%2"".
			|Удалить параметры?'"),
			Строка(ПараметрКонтроляВозраст),
			Строка(ПараметрКонтроляПодтверждениеЧерезMAX));
		
		КнопкиВопроса = Новый СписокЗначений;
		КнопкиВопроса.Добавить(КодВозвратаДиалога.Да, НСтр("ru='Удалить'"));
		КнопкиВопроса.Добавить(КодВозвратаДиалога.Нет, НСтр("ru='Отмена'"));
		
		ПоказатьВопрос(ОповещениеОЗавершении, ТекстВопроса, КнопкиВопроса, 0,
			КодВозвратаДиалога.Да, ЗаголовокВопроса);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказатьОписаниеПараметров(Команда)
	
	ТекстОписания = ?(СписокДоступныхПараметров.Количество() > 0, НСтр("ru='Значения параметров:'"), "");
	Для Каждого ДоступныйПараметр Из СписокДоступныхПараметров Цикл
		ОписаниеПараметра = ПолучитьСтрокуОписанияПараметра(ДоступныйПараметр.Значение);
		ТекстОписания = СтрШаблон("%1%2%3%4", ТекстОписания, Символы.ПС, Символы.ПС, ОписаниеПараметра);
	КонецЦикла;
	Если ТекстОписания = "" Тогда
		ТекстОписания = НСтр("ru='Для данного типа контроля нет доступных параметров.'");
	КонецЕсли;
	
	ПараметрыОткрытияФормы = Новый Структура("ВходящяяИнформация", ТекстОписания);
	ОткрытьФорму("ОбщаяФорма.ФормаИнформации", ПараметрыОткрытияФормы, ЭтотОбъект,,,,
		Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОписаниеПараметровШаблона(Команда)
	
	ПараметрыОткрытияФормы = Новый Структура("ВходящяяИнформация", ТекстПодсказки);
	ОткрытьФорму("ОбщаяФорма.ФормаИнформации", ПараметрыОткрытияФормы, ЭтотОбъект,,,,
		Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗапомнитьТекущийТипПараметра()
	
	ТекущиеДанные = Элементы.ПараметрыКонтроля.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		ПредыдущийПараметр = ТекущиеДанные.Параметр;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЭтоДубльПараметра(СтрокаИсключения)
	
	РезультатФункции = Ложь;
	
	КоличествоСтрок = Объект.ПараметрыКонтроля.Количество();
	ИндексСтроки = 0;
	Пока ИндексСтроки < КоличествоСтрок И Не РезультатФункции Цикл
		СтрокаПараметра = Объект.ПараметрыКонтроля.Получить(ИндексСтроки);
		Если Не СтрокаПараметра = СтрокаИсключения Тогда
			Если СтрокаПараметра.Параметр = СтрокаИсключения.Параметр Тогда
				РезультатФункции = Истина;
			КонецЕсли;
		КонецЕсли;
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Процедура НастроитьПолеЗначения()
	
	КвалификаторЧислаВозраст = Новый КвалификаторыЧисла(3, 0, ДопустимыйЗнак.Неотрицательный);
	КвалификаторыЧислаПредел = Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Неотрицательный);
	
	ПараметрКонтроляПодтверждениеЧерезMAX =
		ПредопределенноеЗначение("Перечисление.ПараметрыКонтроляПродаж.ПодтверждениеЧерезMAX");
	ПараметрКонтроляВозраст = ПредопределенноеЗначение("Перечисление.ПараметрыКонтроляПродаж.Возраст");
	
	Элементы.ПараметрыКонтроляЗначение.РежимВыбораИзСписка = Ложь;
	Элементы.ПараметрыКонтроляЗначение.КнопкаСпискаВыбора = Ложь;
	Элементы.ПараметрыКонтроляЗначение.ТолькоПросмотр = Ложь;
	Элементы.ПараметрыКонтроляЗначение.СписокВыбора.Очистить();
	ТекущиеДанные = Элементы.ПараметрыКонтроля.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		Если ТекущиеДанные.Параметр = ПараметрКонтроляВозраст Тогда
			
			Элементы.ПараметрыКонтроляЗначение.ОграничениеТипа = Новый ОписаниеТипов("Число",,,КвалификаторЧислаВозраст);
			Если ПараметрКонтроляДобавлен(ПараметрКонтроляПодтверждениеЧерезMAX) Тогда
				Элементы.ПараметрыКонтроляЗначение.ТолькоПросмотр = Истина;
			КонецЕсли;
			
		ИначеЕсли ТекущиеДанные.Параметр
				= ПредопределенноеЗначение("Перечисление.ПараметрыКонтроляПродаж.ПредельноеЗначение") Тогда
				
			Элементы.ПараметрыКонтроляЗначение.ОграничениеТипа = Новый ОписаниеТипов("Число",,,КвалификаторыЧислаПредел);
			
		ИначеЕсли ТекущиеДанные.Параметр
				= ПредопределенноеЗначение("Перечисление.ПараметрыКонтроляПродаж.НеВыводитьСообщение") Тогда
				
			Элементы.ПараметрыКонтроляЗначение.ОграничениеТипа = Новый ОписаниеТипов("Строка");
			Элементы.ПараметрыКонтроляЗначение.РежимВыбораИзСписка = Истина;
			Элементы.ПараметрыКонтроляЗначение.КнопкаСпискаВыбора = Истина;
			Элементы.ПараметрыКонтроляЗначение.СписокВыбора.Добавить("Ложь", "Ложь");
			Элементы.ПараметрыКонтроляЗначение.СписокВыбора.Добавить("Истина", "Истина");
			
		ИначеЕсли ТекущиеДанные.Параметр = ПараметрКонтроляПодтверждениеЧерезMAX Тогда
			
			Элементы.ПараметрыКонтроляЗначение.ОграничениеТипа = Новый ОписаниеТипов("Булево");
			Элементы.ПараметрыКонтроляЗначение.ТолькоПросмотр = Истина;
			Если Не ТекущиеДанные.Значение = Истина Тогда
				ТекущиеДанные.Значение = Истина;
			КонецЕсли;
			ДобавитьПараметрКонтроляВозраст(ПараметрКонтроляВозраст);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСообщитьПроЧужиеПараметрыВТекстеШаблона(Отказ)
	
	ПараметрыИзШаблона
		= ИнтерфейсРМКСлужебныйКлиент.ПолучитьПараметрыИзТекстаШаблонаПредупреждения(Объект.ТекстШаблонаПредупреждения);
	КоличествоПараметровШаблона = ПараметрыИзШаблона.Количество();
	ИндексПараметраШаблона = 0;
	Пока ИндексПараметраШаблона < КоличествоПараметровШаблона И Не Отказ Цикл
		ПараметрШаблона = ПараметрыИзШаблона.Получить(ИндексПараметраШаблона);
		Если СписокДоступныхПараметровШаблона.НайтиПоЗначению(ПараметрШаблона) = Неопределено Тогда
			ТекстСообщения = НСтр("ru='Для типа контроля ""[ТипКонтроля]"" не предусмотрен параметр ""[ИмяПараметра]"".'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "[ТипКонтроля]", Строка(Объект.ТипКонтроля));
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "[ИмяПараметра]", ПараметрШаблона);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "ТекстШаблонаПредупреждения", , Отказ);
		КонецЕсли;
		ИндексПараметраШаблона = ИндексПараметраШаблона + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьИзменениеТипаКонтроля()
	
	ОбновитьДоступныеПараметрыПоТипуКонтроля();
	Если ЕстьЧужиеПараметры() Тогда
		
		ТекстВопроса = НСтр("ru='Не используемые для типа контроля ""[ТипКонтроля]"" параметры будут очищены. Продолжить?'");
		ТекстВопроса = СтрЗаменить(ТекстВопроса, "[ТипКонтроля]", Строка(Объект.ТипКонтроля));
		
		ОповещениеОтветаОбИзмененииТипаКонтроля
			= Новый ОписаниеОповещения("ОбработатьОтветОбИзмененииТипаКонтроля", ЭтотОбъект);
		
		ПоказатьВопрос(ОповещениеОтветаОбИзмененииТипаКонтроля, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		ОбработатьИзменениеТипаКонтроля();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОтветОбИзмененииТипаКонтроля(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОбработатьИзменениеТипаКонтроля();
		УдалитьЧужиеПараметры();
	Иначе
		Объект.ТипКонтроля = ПредыдущийТипКонтроля;
		ОбновитьДоступныеПараметрыПоТипуКонтроля();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЧужиеПараметры()
	
	КоличествоПараметров = Объект.ПараметрыКонтроля.Количество();
	ИндексПараметра = 0;
	Пока ИндексПараметра < КоличествоПараметров Цикл
		ТекущийИндекс = КоличествоПараметров - ИндексПараметра - 1;
		СтрокаПараметра = Объект.ПараметрыКонтроля.Получить(ТекущийИндекс);
		Если СписокДоступныхПараметров.НайтиПоЗначению(СтрокаПараметра.Параметр) = Неопределено Тогда
			Объект.ПараметрыКонтроля.Удалить(ТекущийИндекс);
		КонецЕсли;
		ИндексПараметра = ИндексПараметра + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ЕстьЧужиеПараметры()
	
	РезультатФункции = Ложь;
	
	КоличествоПараметров = Объект.ПараметрыКонтроля.Количество();
	ИндексПараметра = 0;
	Пока ИндексПараметра < КоличествоПараметров И Не РезультатФункции Цикл
		СтрокаПараметра = Объект.ПараметрыКонтроля.Получить(ИндексПараметра);
		Если СписокДоступныхПараметров.НайтиПоЗначению(СтрокаПараметра.Параметр) = Неопределено Тогда
			РезультатФункции = Истина;
		КонецЕсли;
		ИндексПараметра = ИндексПараметра + 1;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьИзменениеТипаКонтроля()
	
	ТипыКонтроляНаЧек = ИнтерфейсРМКСлужебныйКлиентСервер.ТипыКонтроляНаЧек();
	СписокДоступныхПараметровШаблона.Очистить();
	
	ПредыдущийТипКонтроля = Объект.ТипКонтроля;
	ТекстПодсказки = НСтр("ru='Значения параметров шаблона:
	|'");
	ЧастьПодсказкиГруппаТоваров = НСтр("ru='
		|[ГруппаТоваров] - значение реквизита ""Группа товаров"" из справочника ""Контроль продаж"".'");
	ЧастьПодсказкиОписаниеПериода = НСтр("ru='
		|[ОписаниеПериода] - формируется по значениям в строке контроля справочника ""Контроль продаж"".'");
	Если ЗначениеЗаполнено(Объект.ТипКонтроля) И ТипыКонтроляНаЧек.Найти(Объект.ТипКонтроля) = Неопределено Тогда
		ТекстПодсказки = СтрШаблон("%1%2", ТекстПодсказки, ЧастьПодсказкиГруппаТоваров);
		СписокДоступныхПараметровШаблона.Добавить(НСтр("ru='ГруппаТоваров'"));
	КонецЕсли;
	ТекстПодсказки = СтрШаблон("%1%2", ТекстПодсказки, ЧастьПодсказкиОписаниеПериода);
	СписокДоступныхПараметровШаблона.Добавить(НСтр("ru='ОписаниеПериода'"));
	
	ЧастьПодсказкиВозраст = НСтр("ru='
		|[Возраст] - значение параметра вида контроля ""Возраст"".
		|[ДатаРождения] - формируется дата, от текущей даты минус значение параметра вида контроля ""Возраст"".'");
	
	ЧастьПодсказкиТовар = НСтр("ru='
		|[ПредставлениеТовара] - представление проверяемого товара, как указано в списке товаров.'");
	
	Если Объект.ТипКонтроля = ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ПроверкаПокупателя") Тогда
		ТекстПодсказки = СтрШаблон("%1%2", ТекстПодсказки, ЧастьПодсказкиВозраст);
		СписокДоступныхПараметровШаблона.Добавить(НСтр("ru='Возраст'"));
		СписокДоступныхПараметровШаблона.Добавить(НСтр("ru='ДатаРождения'"));
	КонецЕсли;

	ТипыКонтроляСПредставлениемТовара = ПолучитьТипыКонтроляСПредставленимТовара();
	Если Не ТипыКонтроляСПредставлениемТовара.Найти(Объект.ТипКонтроля) = Неопределено Тогда
		ТекстПодсказки = СтрШаблон("%1%2", ТекстПодсказки, ЧастьПодсказкиТовар);
		СписокДоступныхПараметровШаблона.Добавить(НСтр("ru='ПредставлениеТовара'"));
	КонецЕсли;
	Элементы.ПараметрыКонтроляПараметр.СписокВыбора.ЗагрузитьЗначения(СписокДоступныхПараметров.ВыгрузитьЗначения());
	Элементы.ПараметрыКонтроля.Доступность = (СписокДоступныхПараметров.Количество() > 0);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьТипыКонтроляСПредставленимТовара()
	
	РезультатФункции = Новый Массив;
	РезультатФункции.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ЗапретПодбора"));
	РезультатФункции.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ПроверкаПокупателя"));
	РезультатФункции.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКонтроля.КонтрольСотрудникомНаКСО"));
	РезультатФункции.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ЛимитКоличестваВСтроке"));
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьДоступныеПараметрыПоТипуКонтроля()

	ПараметрНеВыводитьСообщение = ПредопределенноеЗначение("Перечисление.ПараметрыКонтроляПродаж.НеВыводитьСообщение");
	
	ТипЛимитКоличествоВСтроке = ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ЛимитКоличестваВСтроке");
	ТипЛимитКоличествоСтрок = ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ЛимитКоличестваСтрокВЧеке");
	ТипЛимитСумма = ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ЛимитСуммыВЧеке");
	
	ТипыКонтроляПредельныхЗначений = Новый Массив;
	ТипыКонтроляПредельныхЗначений.Добавить(ТипЛимитКоличествоВСтроке);
	ТипыКонтроляПредельныхЗначений.Добавить(ТипЛимитКоличествоСтрок);
	ТипыКонтроляПредельныхЗначений.Добавить(ТипЛимитСумма);
	
	СписокДоступныхПараметров.Очистить();
	Если Объект.ТипКонтроля = ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ПроверкаПокупателя") Тогда
		СписокДоступныхПараметров.Добавить(ПредопределенноеЗначение("Перечисление.ПараметрыКонтроляПродаж.Возраст"));
		СписокДоступныхПараметров.Добавить(
			ПредопределенноеЗначение("Перечисление.ПараметрыКонтроляПродаж.ПодтверждениеЧерезMAX"));
	ИначеЕсли Объект.Ссылка = ПредопределенноеЗначение("Справочник.ВидыКонтроля.ЗапретОплатыБонусами") Тогда
		СписокДоступныхПараметров.Добавить(ПараметрНеВыводитьСообщение);
	ИначеЕсли Не ТипыКонтроляПредельныхЗначений.Найти(Объект.ТипКонтроля) = Неопределено Тогда
		ПараметрЛимит = ПредопределенноеЗначение("Перечисление.ПараметрыКонтроляПродаж.ПредельноеЗначение");
		СписокДоступныхПараметров.Добавить(ПараметрНеВыводитьСообщение);
		СписокДоступныхПараметров.Добавить(ПараметрЛимит);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтрокуОписанияПараметра(ПараметрКонтроля)
	
	РезультатФункции = "";
	
	Если ПараметрКонтроля = ПредопределенноеЗначение("Перечисление.ПараметрыКонтроляПродаж.Возраст") Тогда
		РезультатФункции = НСтр("ru='""Возраст"" - контроль будет пройден, если возраст покупателя равен или выше указанного
		|	возраста. Указывается в годах.'");
	ИначеЕсли ПараметрКонтроля = ПредопределенноеЗначение("Перечисление.ПараметрыКонтроляПродаж.НеВыводитьСообщение") Тогда
		РезультатФункции = НСтр("ru='""Не выводить сообщение"" - если параметр установлен в Истина, то при добавлении товара
		|	или изменении количества или цены на форме рабочего места кассира пользователю
		|	не выходит предупреждение. Предупреждение будет выведено только при переходе
		|	к оплате.'");
	ИначеЕсли ПараметрКонтроля = ПредопределенноеЗначение("Перечисление.ПараметрыКонтроляПродаж.ПредельноеЗначение") Тогда
		РезультатФункции = НСтр("ru='""Предельное значение"" - величина, при превышении которой в проверяемом свойстве сработает
		|	ограничение продажи.'");
	ИначеЕсли ПараметрКонтроля = ПредопределенноеЗначение(
		"Перечисление.ПараметрыКонтроляПродаж.ПодтверждениеЧерезMAX") Тогда
		РезультатФункции = НСтр("ru='""Подтверждение через MAX"" - включает возможность проверки возраста через MAX. Для
		|	параметра ""Возраст"" будет установлено значение ""18"", если параметра нет, то он будет
		|	добавлен.
		|	Для работы параметра ""Подтверждение через MAX"" необходимо в настройках рабочего места кассира включить опцию
		|	""Использовать подтверждение возраста через MAX"", иначе вид контроля будет работать без
		|	учета параметра ""Подтверждение через MAX"".'");
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Процедура ПродолжениеПараметрыКонтроляУдаление(Результат, Параметры) Экспорт
	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	Объект.ПараметрыКонтроля.Очистить();
КонецПроцедуры

&НаКлиенте
Функция ПараметрКонтроляДобавлен(ПараметрКонтроля)
	
	ПараметрыОтбора = Новый Структура("Параметр", ПараметрКонтроля);
	НайденныеПараметрыКонтроля = Объект.ПараметрыКонтроля.НайтиСтроки(ПараметрыОтбора);
	
	Возврат НайденныеПараметрыКонтроля.Количество() <> 0;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьПараметрКонтроляВозраст(ПараметрКонтроляВозраст)
	ПараметрыОтбора = Новый Структура("Параметр", ПараметрКонтроляВозраст);
	НайденныеПараметрыКонтроля = Объект.ПараметрыКонтроля.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеПараметрыКонтроля.Количество() Тогда
		Для каждого ПараметрКонтроля Из НайденныеПараметрыКонтроля Цикл
			Если ПараметрКонтроля.Значение <> 18 Тогда
				ПараметрКонтроля.Значение = 18;
			КонецЕсли;
		КонецЦикла;
	Иначе
		НовыйПараметрКонтроля = Объект.ПараметрыКонтроля.Добавить();
		НовыйПараметрКонтроля.Параметр = ПараметрКонтроляВозраст;
		НовыйПараметрКонтроля.Значение = 18;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
